# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'cowsay'
brew 'fortune'
brew 'getantibody/tap/antibody' # ZSH Plugin Manager
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'lolcat'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tldr'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'mariadb'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'cisco-anyconnect'
cask 'contraste'
cask 'discord'
cask 'docker'
cask 'firefox-developer-edition'
cask 'github'
cask 'google-chrome'
cask 'hyper'
cask 'java'
cask 'karabiner-elements'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'notion'
cask 'paw'
cask 'slack'
cask 'tableplus'
cask 'tower'
cask 'transmit'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Magnet', id: 441258766
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'MindNode', id: 1289197285
mas 'The Unarchiver', id: 425424353
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas "Xcode", id: 497799835
